benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-cal-49169.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  659.80us   3.51ms   66.08%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.17ms
 75.000%    1.72ms
 90.000%    2.29ms
 99.000%    2.84ms
 99.900%    3.05ms
 99.990%    3.37ms
 99.999%    3.48ms
100.000%    3.51ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.049     0.000000            1         1.00
       0.501     0.100000        48696         1.11
       0.660     0.200000        96869         1.25
       0.825     0.300000       145183         1.43
       0.988     0.400000       193612         1.67
       1.170     0.500000       241993         2.00
       1.278     0.550000       266362         2.22
       1.388     0.600000       290456         2.50
       1.502     0.650000       314551         2.86
       1.613     0.700000       338961         3.33
       1.722     0.750000       363119         4.00
       1.777     0.775000       375054         4.44
       1.837     0.800000       387207         5.00
       1.906     0.825000       399360         5.71
       1.991     0.850000       411381         6.67
       2.121     0.875000       423446         8.00
       2.211     0.887500       429599         8.89
       2.291     0.900000       435613        10.00
       2.371     0.912500       441629        11.43
       2.449     0.925000       447755        13.33
       2.517     0.937500       453763        16.00
       2.549     0.943750       456735        17.78
       2.585     0.950000       459887        20.00
       2.619     0.956250       462930        22.86
       2.653     0.962500       465908        26.67
       2.687     0.968750       468839        32.00
       2.707     0.971875       470410        35.56
       2.725     0.975000       471841        40.00
       2.747     0.978125       473479        45.71
       2.767     0.981250       474875        53.33
       2.791     0.984375       476444        64.00
       2.803     0.985938       477170        71.11
       2.815     0.987500       477911        80.00
       2.829     0.989062       478683        91.43
       2.845     0.990625       479448       106.67
       2.861     0.992188       480165       128.00
       2.871     0.992969       480577       142.22
       2.881     0.993750       480962       160.00
       2.891     0.994531       481287       182.86
       2.905     0.995313       481669       213.33
       2.921     0.996094       482036       256.00
       2.931     0.996484       482222       284.44
       2.943     0.996875       482445       320.00
       2.953     0.997266       482602       365.71
       2.969     0.997656       482799       426.67
       2.987     0.998047       482992       512.00
       2.999     0.998242       483082       568.89
       3.009     0.998437       483165       640.00
       3.021     0.998633       483260       731.43
       3.037     0.998828       483356       853.33
       3.051     0.999023       483451      1024.00
       3.059     0.999121       483501      1137.78
       3.067     0.999219       483544      1280.00
       3.077     0.999316       483596      1462.86
       3.089     0.999414       483643      1706.67
       3.099     0.999512       483690      2048.00
       3.105     0.999561       483713      2275.56
       3.113     0.999609       483731      2560.00
       3.125     0.999658       483758      2925.71
       3.141     0.999707       483780      3413.33
       3.157     0.999756       483802      4096.00
       3.173     0.999780       483815      4551.11
       3.185     0.999805       483827      5120.00
       3.229     0.999829       483839      5851.43
       3.273     0.999854       483850      6826.67
       3.337     0.999878       483861      8192.00
       3.355     0.999890       483868      9102.22
       3.379     0.999902       483874     10240.00
       3.403     0.999915       483879     11702.86
       3.411     0.999927       483885     13653.33
       3.427     0.999939       483891     16384.00
       3.433     0.999945       483894     18204.44
       3.439     0.999951       483898     20480.00
       3.447     0.999957       483900     23405.71
       3.465     0.999963       483904     27306.67
       3.467     0.999969       483906     32768.00
       3.469     0.999973       483908     36408.89
       3.471     0.999976       483909     40960.00
       3.473     0.999979       483910     46811.43
       3.475     0.999982       483912     54613.33
       3.477     0.999985       483913     65536.00
       3.479     0.999986       483914     72817.78
       3.483     0.999988       483915     81920.00
       3.483     0.999989       483915     93622.86
       3.487     0.999991       483916    109226.67
       3.489     0.999992       483918    131072.00
       3.489     0.999993       483918    145635.56
       3.489     0.999994       483918    163840.00
       3.489     0.999995       483918    187245.71
       3.489     0.999995       483918    218453.33
       3.497     0.999996       483919    262144.00
       3.497     0.999997       483919    291271.11
       3.497     0.999997       483919    327680.00
       3.497     0.999997       483919    374491.43
       3.497     0.999998       483919    436906.67
       3.507     0.999998       483920    524288.00
       3.507     1.000000       483920          inf
#[Mean    =        1.281, StdDeviation   =        0.660]
#[Max     =        3.506, Total count    =       483920]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  483929 requests in 10.00s, 54.00MB read
Requests/sec:  48392.55
Transfer/sec:      5.40MB