benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-cal-62407.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  669.61us   3.51ms   66.66%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.73ms
 90.000%    2.29ms
 99.000%    3.03ms
 99.900%    3.29ms
 99.990%    3.42ms
 99.999%    3.50ms
100.000%    3.51ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.033     0.000000            1         1.00
       0.535     0.100000        61454         1.11
       0.691     0.200000       123223         1.25
       0.846     0.300000       184620         1.43
       1.026     0.400000       245792         1.67
       1.225     0.500000       307237         2.00
       1.323     0.550000       337871         2.22
       1.421     0.600000       368734         2.50
       1.519     0.650000       399460         2.86
       1.620     0.700000       430041         3.33
       1.733     0.750000       460684         4.00
       1.796     0.775000       476109         4.44
       1.868     0.800000       491431         5.00
       1.950     0.825000       506904         5.71
       2.045     0.850000       522086         6.67
       2.159     0.875000       537540         8.00
       2.225     0.887500       545270         8.89
       2.291     0.900000       552891        10.00
       2.363     0.912500       560491        11.43
       2.441     0.925000       568179        13.33
       2.525     0.937500       575972        16.00
       2.569     0.943750       579773        17.78
       2.615     0.950000       583662        20.00
       2.663     0.956250       587429        22.86
       2.711     0.962500       591189        26.67
       2.765     0.968750       595140        32.00
       2.793     0.971875       596947        35.56
       2.825     0.975000       598893        40.00
       2.859     0.978125       600805        45.71
       2.897     0.981250       602810        53.33
       2.935     0.984375       604622        64.00
       2.959     0.985938       605587        71.11
       2.985     0.987500       606585        80.00
       3.013     0.989062       607547        91.43
       3.045     0.990625       608513       106.67
       3.075     0.992188       609450       128.00
       3.091     0.992969       609908       142.22
       3.111     0.993750       610404       160.00
       3.133     0.994531       610896       182.86
       3.159     0.995313       611360       213.33
       3.183     0.996094       611824       256.00
       3.195     0.996484       612061       284.44
       3.209     0.996875       612316       320.00
       3.221     0.997266       612543       365.71
       3.237     0.997656       612798       426.67
       3.253     0.998047       613048       512.00
       3.261     0.998242       613171       568.89
       3.269     0.998437       613292       640.00
       3.275     0.998633       613385       731.43
       3.285     0.998828       613513       853.33
       3.293     0.999023       613620      1024.00
       3.301     0.999121       613703      1137.78
       3.307     0.999219       613744      1280.00
       3.315     0.999316       613800      1462.86
       3.325     0.999414       613861      1706.67
       3.337     0.999512       613923      2048.00
       3.343     0.999561       613953      2275.56
       3.349     0.999609       613986      2560.00
       3.355     0.999658       614009      2925.71
       3.367     0.999707       614039      3413.33
       3.379     0.999756       614070      4096.00
       3.387     0.999780       614086      4551.11
       3.393     0.999805       614100      5120.00
       3.399     0.999829       614114      5851.43
       3.405     0.999854       614129      6826.67
       3.413     0.999878       614145      8192.00
       3.417     0.999890       614152      9102.22
       3.423     0.999902       614160     10240.00
       3.427     0.999915       614165     11702.86
       3.431     0.999927       614175     13653.33
       3.437     0.999939       614181     16384.00
       3.443     0.999945       614184     18204.44
       3.451     0.999951       614188     20480.00
       3.457     0.999957       614191     23405.71
       3.469     0.999963       614196     27306.67
       3.473     0.999969       614199     32768.00
       3.477     0.999973       614201     36408.89
       3.483     0.999976       614203     40960.00
       3.485     0.999979       614204     46811.43
       3.491     0.999982       614207     54613.33
       3.493     0.999985       614208     65536.00
       3.499     0.999986       614210     72817.78
       3.499     0.999988       614210     81920.00
       3.501     0.999989       614213     93622.86
       3.501     0.999991       614213    109226.67
       3.501     0.999992       614213    131072.00
       3.501     0.999993       614213    145635.56
       3.503     0.999994       614214    163840.00
       3.503     0.999995       614214    187245.71
       3.505     0.999995       614215    218453.33
       3.505     0.999996       614215    262144.00
       3.505     0.999997       614215    291271.11
       3.507     0.999997       614216    327680.00
       3.507     0.999997       614216    374491.43
       3.507     0.999998       614216    436906.67
       3.507     0.999998       614216    524288.00
       3.507     0.999998       614216    582542.22
       3.509     0.999998       614217    655360.00
       3.509     1.000000       614217          inf
#[Mean    =        1.314, StdDeviation   =        0.670]
#[Max     =        3.508, Total count    =       614217]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  614237 requests in 10.00s, 68.54MB read
Requests/sec:  61422.90
Transfer/sec:      6.85MB